Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.hooks.amp.alreadyUpToDate
source: Amp hooks already up to date at %@
ar: خطافات Amp محدثة بالفعل في %@
bs: Amp kuke su već ažurirane na %@
da: Amp-hooks er allerede opdateret på %@
de: Amp-Hooks sind unter %@ bereits aktuell
es: Los hooks de Amp ya están actualizados en %@
fr: Les hooks Amp sont déjà à jour dans %@
it: Gli hook di Amp sono già aggiornati in %@
ja: %@ の Amp フックはすでに最新です
ko: %@의 Amp 훅은 이미 최신 상태입니다
nb: Amp-hooks er allerede oppdatert på %@
pl: Hooki Amp w %@ są już aktualne
pt_br: Os hooks do Amp já estão atualizados em %@
ru: Хуки Amp в %@ уже обновлены
th: ฮุก Amp ที่ %@ เป็นเวอร์ชันล่าสุดแล้ว
tr: %@ konumundaki Amp kancaları zaten güncel
uk: Хуки Amp у %@ вже оновлено
zh_hans: %@ 中的 Amp Hook 已是最新版本
zh_hant: %@ 中的 Amp Hook 已是最新版本

# cli.hooks.antigravity.aborted
source: Aborted.
ar: تم الإلغاء.
de: Abgebrochen.
es: Abortado.
fr: Annulé.
ja: 中止しました。
ko: 중단되었습니다.
zh_hans: 已中止。
zh_hant: 已中止。

# cli.hooks.antigravity.alreadyUpToDate
source: %@ hooks already up to date at %@
ar: خطافات %@ محدثة بالفعل في %@
de: %@-Hooks unter %@ bereits auf dem neuesten Stand
es: Los hooks de %@ ya están actualizados en %@
fr: hooks de %@ déjà à jour dans %@
ja: %@ hooks はすでに %@ で最新です
ko: %@ 훅이 이미 %@에서 최신 상태입니다.
zh_hans: %@ hooks 已是最新，位置：%@
zh_hant: %@ 勾點在 %@ 已是最新狀態

# cli.hooks.antigravity.confirmProceed
source: Proceed? [y/N]
ar: هل ترغب في المتابعة؟ [y/N]
de: Fortfahren? [j/N]
es: ¿Proceder? [s/N]
fr: Continuer ? [o/N]
ja: 続行しますか? [y/N]
ko: 계속하시겠습니까? [y/N]
zh_hans: 是否继续？ [y/N]
zh_hant: 是否繼續？ [y/N]

# cli.hooks.antigravity.error.invalidJSON
source: %@ exists but is not valid JSON. Fix or remove it before installing hooks.
ar: الملف %@ موجود ولكنه ليس بتنسيق JSON صالح. قم بإصلاحه أو إزالته قبل تثبيت الخطافات.
de: „%@“ existiert, ist aber kein gültiges JSON. Korrigiere oder entferne es, bevor du Hooks installierst.
es: %@ existe pero no es un JSON válido. Corríjalo o elimínelo antes de instalar los hooks.
fr: %@ existe mais n'est pas un JSON valide. Corrigez-le ou supprimez-le avant d'installer les hooks.
ja: %@ は存在しますが、有効な JSON ではありません。hooks をインストールする前に修正または削除してください。
ko: %@이(가) 존재하지만 유효한 JSON이 아닙니다. 훅을 설치하기 전에 수정하거나 제거하십시오.
zh_hans: %@ 存在但不是有效的 JSON。请先修复或移除它，再安装 hooks。
zh_hant: %@ 存在，但不是有效的 JSON。請在安裝勾點前修正或移除它。

# cli.hooks.antigravity.installed
source: %@ hooks installed at %@
ar: تم تثبيت خطافات %@ في %@
de: %@-Hooks wurden unter %@ installiert
es: Hooks de %@ instalados en %@
fr: Hooks %@ installés à l'emplacement %@
ja: %@ hooks を %@ にインストールしました
ko: %@ 훅이 %@에 설치되었습니다.
zh_hans: 已安装 %@ hooks，位置：%@
zh_hant: %@ 勾點已安裝於 %@

# cli.hooks.antigravity.malformedJSON
source: Malformed %@ at %@. Fix or remove it before uninstalling hooks.
ar: تنسيق %@ غير صالح في %@. قم بإصلاحه أو إزالته قبل إلغاء تثبيت الخطافات.
de: Fehlerhaftes %@ unter %@. Korrigiere oder entferne es, bevor du Hooks deinstallierst.
es: %@ malformado en %@. Corríjalo o elimínelo antes de desinstalar los hooks.
fr: %@ malformé à l'emplacement %@. Corrigez-le ou supprimez-le avant de désinstaller les hooks.
ja: %@ が %@ で不正な JSON です。hooks をアンインストールする前に修正または削除してください。
ko: 잘못된 형식의 %@(이)가 %@에 있습니다. hooks를 언인스톨하기 전에 이를 수정하거나 제거하십시오.
zh_hans: %@ 格式错误，位置：%@。请先修复或移除它，再卸载 hooks。
zh_hant: 格式不正確的 %@ 位於 %@。請在解除安裝 hooks 之前修復或移除它。

# cli.hooks.antigravity.noneFound
source: No %@ found at %@
ar: لم يتم العثور على أي %@ في %@
de: Kein %@ unter %@ gefunden
es: No se encontró ningún %@ en %@
fr: Aucun %@ trouvé à l'emplacement %@
ja: %@ は %@ に見つかりませんでした
ko: %@(이)가 %@에서 발견되지 않았습니다
zh_hans: 未找到 %@，位置：%@
zh_hant: %@ 未於 %@ 尋獲

# cli.hooks.antigravity.removed
source: Removed Antigravity cmux hooks from %@
ar: تمت إزالة خطافات Antigravity cmux من %@
de: Antigravity-cmux-Hooks aus %@ entfernt
es: Se eliminaron los hooks de cmux de Antigravity de %@
fr: Hooks cmux d'Antigravity supprimés de %@
ja: %@ から Antigravity cmux hooks を削除しました
ko: %@에서 Antigravity cmux 훅을 제거했습니다.
zh_hans: 已从 %@ 移除 Antigravity cmux hooks
zh_hant: 已從 %@ 移除 Antigravity cmux 勾點

# cli.hooks.antigravity.removedZero
source: Removed 0 cmux hook(s) from %@
ar: تمت إزالة 0 من خطافات cmux من %@
de: 0 cmux-Hook(s) aus %@ entfernt
es: Se eliminaron 0 hooks de cmux de %@
fr: 0 hook(s) cmux supprimé(s) de %@
ja: %@ から 0 個の cmux hook を削除しました
ko: %@에서 0개의 cmux 훅을 제거했습니다.
zh_hans: 已从 %@ 移除 0 个 cmux hook
zh_hant: 已從 %@ 移除 0 個 cmux 勾點

# cli.hooks.campfire.aborted
source: Aborted.
ar: أُلغيَت العملية.
bs: Prekinuto.
da: Afbrudt.
de: Abgebrochen.
es: Operación cancelada.
fr: Opération annulée.
it: Operazione annullata.
ja: 中止しました。
ko: 중단했습니다.
nb: Avbrutt.
pl: Przerwano.
pt_br: Abortado.
ru: Операция прервана.
th: ยกเลิกแล้ว
tr: İptal edildi.
uk: Операцію скасовано.
zh_hans: 已中止。
zh_hant: 已中止。

# cli.hooks.campfire.alreadyUpToDate
source: Campfire hooks already up to date at %@
ar: خطافات Campfire محدَّثة بالفعل في %@
bs: Campfire hookovi su već ažurirani u %@
da: Campfire-hooks er allerede opdaterede i %@
de: Campfire-Hooks sind in %@ bereits auf dem neuesten Stand
es: Los hooks de Campfire ya están actualizados en %@
fr: Les hooks Campfire sont déjà à jour dans %@
it: Gli hook di Campfire sono già aggiornati in %@
ja: %@ の Campfire フックはすでに最新です
ko: %@의 Campfire 훅은 이미 최신 상태입니다
nb: Campfire-hooks er allerede oppdatert i %@
pl: Hooki Campfire są już aktualne w %@
pt_br: Os hooks do Campfire já estão atualizados em %@
ru: Хуки Campfire в %@ уже актуальны
th: ฮุก Campfire ที่ %@ เป็นเวอร์ชันล่าสุดอยู่แล้ว
tr: Campfire kancaları %@ konumunda zaten güncel
uk: Хуки Campfire у %@ вже актуальні
zh_hans: %@ 中的 Campfire hooks 已是最新
zh_hant: %@ 中的 Campfire hooks 已是最新

# cli.hooks.campfire.confirmProceed
source: Proceed? [y/N]
ar: هل تريد المتابعة؟ [y/N]
bs: Nastaviti? [y/N]
da: Fortsæt? [y/N]
de: Fortfahren? [y/N]
es: ¿Continuar? [y/N]
fr: Continuer ? [y/N]
it: Procedere? [y/N]
ja: 続行しますか？ [y/N]
ko: 계속하시겠습니까? [y/N]
nb: Fortsette? [y/N]
pl: Kontynuować? [y/N]
pt_br: Prosseguir? [y/N]
ru: Продолжить? [y/N]
th: ดำเนินการต่อหรือไม่? [y/N]
tr: Devam edilsin mi? [y/N]
uk: Продовжити? [y/N]
zh_hans: 是否继续？ [y/N]
zh_hant: 是否繼續？ [y/N]

# cli.hooks.campfire.error.notCmuxExtension
source: %@ exists and is not a cmux extension; leaving it alone
ar: %@ موجود وليس امتداد cmux؛ سيتم تركه كما هو
bs: %@ postoji i nije cmux ekstenzija; ostavljam ga netaknutim
da: %@ findes og er ikke en cmux-udvidelse; lader den være
de: %@ existiert und ist keine cmux-Erweiterung; wird unverändert belassen
es: %@ existe y no es una extensión de cmux; se dejará intacto
fr: %@ existe et n’est pas une extension cmux ; aucun changement n’y sera apporté
it: %@ esiste e non è un'estensione cmux; verrà lasciato invariato
ja: %@ は存在しますが cmux 拡張ではありません。そのままにします
ko: %@이(가) 존재하지만 cmux 확장이 아니므로 그대로 둡니다
nb: %@ finnes og er ikke en cmux-utvidelse; lar den være i fred
pl: %@ istnieje i nie jest rozszerzeniem cmux; pozostawiam bez zmian
pt_br: %@ existe e não é uma extensão do cmux; será deixado como está
ru: %@ существует и не является расширением cmux; оставляем без изменений
th: %@ มีอยู่แล้วและไม่ใช่ส่วนขยาย cmux; จะปล่อยไว้ตามเดิม
tr: %@ mevcut ve bir cmux uzantısı değil; olduğu gibi bırakılıyor
uk: %@ існує і не є розширенням cmux; залишаємо без змін
zh_hans: %@ 已存在且不是 cmux 扩展；将保持不变
zh_hant: %@ 已存在且不是 cmux 擴充功能；將維持原樣

# cli.hooks.campfire.error.readFailed
source: Failed to read %@
ar: فشل في قراءة %@
bs: Čitanje %@ nije uspjelo
da: Kunne ikke læse %@
de: Fehler beim Lesen von %@
es: No se pudo leer %@
fr: Échec de la lecture de %@
it: Impossibile leggere %@
ja: %@ の読み取りに失敗しました
ko: %@을(를) 읽지 못했습니다
nb: Klarte ikke å lese %@
pl: Nie udało się odczytać %@
pt_br: Falha ao ler %@
ru: Не удалось прочитать %@
th: อ่าน %@ ไม่สำเร็จ
tr: %@ okunamadı
uk: Не вдалося прочитати %@
zh_hans: 读取 %@ 失败
zh_hant: 讀取 %@ 失敗

# cli.hooks.campfire.installed
source: Campfire hooks installed at %@
ar: تم تثبيت خطافات Campfire في %@
bs: Campfire hookovi su instalirani u %@
da: Campfire-hooks er installeret i %@
de: Campfire-Hooks wurden in %@ installiert
es: Hooks de Campfire instalados en %@
fr: Hooks Campfire installés dans %@
it: Hook di Campfire installati in %@
ja: Campfire フックを %@ にインストールしました
ko: %@에 Campfire 훅을 설치했습니다
nb: Campfire-hooks er installert i %@
pl: Zainstalowano hooki Campfire w %@
pt_br: Hooks do Campfire instalados em %@
ru: Хуки Campfire установлены в %@
th: ติดตั้งฮุก Campfire ที่ %@ แล้ว
tr: Campfire kancaları %@ konumuna kuruldu
uk: Хуки Campfire встановлено в %@
zh_hans: 已在 %@ 安装 Campfire hooks
zh_hant: 已在 %@ 安裝 Campfire hooks

# cli.hooks.campfire.noneFound
source: No Campfire cmux extension found at %@
ar: لم يتم العثور على امتداد Campfire cmux في %@
bs: Nijedna Campfire cmux ekstenzija nije pronađena u %@
da: Ingen Campfire cmux-udvidelse fundet i %@
de: Keine Campfire-cmux-Erweiterung in %@ gefunden
es: No se encontró ninguna extensión Campfire cmux en %@
fr: Aucune extension Campfire cmux trouvée dans %@
it: Nessuna estensione Campfire cmux trovata in %@
ja: %@ に Campfire cmux 拡張が見つかりません
ko: %@에서 Campfire cmux 확장을 찾을 수 없습니다
nb: Fant ingen Campfire cmux-utvidelse i %@
pl: Nie znaleziono rozszerzenia Campfire cmux w %@
pt_br: Nenhuma extensão Campfire cmux encontrada em %@
ru: Расширение Campfire cmux в %@ не найдено
th: ไม่พบส่วนขยาย Campfire cmux ที่ %@
tr: %@ konumunda Campfire cmux uzantısı bulunamadı
uk: Розширення Campfire cmux у %@ не знайдено
zh_hans: 未在 %@ 找到 Campfire cmux 扩展
zh_hant: 未在 %@ 找到 Campfire cmux 擴充功能

# cli.hooks.campfire.refuseRemoveMissingMarker
source: Refusing to remove %@: missing cmux marker
ar: تم رفض إزالة %@: علامة cmux مفقودة
bs: Odbijam uklanjanje %@: nedostaje cmux oznaka
da: Nægter at fjerne %@: manglende cmux-markør
de: %@ wird nicht entfernt: cmux-Markierung fehlt
es: Se rechaza eliminar %@: falta el marcador de cmux
fr: Suppression de %@ refusée : marqueur cmux manquant
it: Rimozione di %@ rifiutata: marcatore cmux mancante
ja: %@ の削除を拒否しました: cmux マーカーがありません
ko: %@ 삭제를 거부합니다: cmux 마커가 없습니다
nb: Nekter å fjerne %@: manglende cmux-markør
pl: Odmowa usunięcia %@: brak znacznika cmux
pt_br: Recusando remover %@: marcador do cmux ausente
ru: Отказ в удалении %@: отсутствует маркер cmux
th: ปฏิเสธที่จะลบ %@: ไม่มีเครื่องหมาย cmux
tr: %@ kaldırılmayı reddediliyor: cmux işareti eksik
uk: Відмовлено у видаленні %@: відсутній маркер cmux
zh_hans: 拒绝移除 %@：缺少 cmux 标记
zh_hant: 拒絕移除 %@：缺少 cmux 標記

# cli.hooks.campfire.removed
source: Removed Campfire cmux extension from %@
ar: تمت إزالة امتداد Campfire cmux من %@
bs: Campfire cmux ekstenzija je uklonjena iz %@
da: Campfire cmux-udvidelse blev fjernet fra %@
de: Campfire-cmux-Erweiterung aus %@ entfernt
es: Se eliminó la extensión Campfire cmux de %@
fr: Extension Campfire cmux supprimée de %@
it: Estensione Campfire cmux rimossa da %@
ja: %@ から Campfire cmux 拡張を削除しました
ko: %@에서 Campfire cmux 확장을 제거했습니다
nb: Fjernet Campfire cmux-utvidelse fra %@
pl: Usunięto rozszerzenie Campfire cmux z %@
pt_br: Extensão Campfire cmux removida de %@
ru: Расширение Campfire cmux удалено из %@
th: ลบส่วนขยาย Campfire cmux ออกจาก %@ แล้ว
tr: Campfire cmux uzantısı %@ konumundan kaldırıldı
uk: Розширення Campfire cmux видалено з %@
zh_hans: 已从 %@ 移除 Campfire cmux 扩展
zh_hant: 已從 %@ 移除 Campfire cmux 擴充功能

# cli.hooks.error.configDirectoryCreateFailed
source: cmux could not create the hooks directory at %@. Check the parent directory permissions and try again.
ar: تعذّر على cmux إنشاء دليل hooks في %@. تحقّق من أذونات الدليل الأصل ثم أعد المحاولة.
bs: cmux nije mogao kreirati direktorij hookova na %@. Provjerite dozvole nadređenog direktorija i pokušajte ponovo.
da: cmux kunne ikke oprette hookmappen på %@. Kontrollér tilladelserne for den overordnede mappe, og prøv igen.
de: cmux konnte das Hook-Verzeichnis unter %@ nicht erstellen. Prüfe die Berechtigungen des übergeordneten Verzeichnisses und versuche es erneut.
es: cmux no pudo crear el directorio de hooks en %@. Comprueba los permisos del directorio superior e inténtalo de nuevo.
fr: cmux n’a pas pu créer le dossier des hooks à l’emplacement %@. Vérifiez les autorisations du dossier parent et réessayez.
it: cmux non è riuscito a creare la directory degli hook in %@. Controlla i permessi della directory principale e riprova.
ja: cmux は %@ に hooks ディレクトリを作成できませんでした。親ディレクトリの権限を確認して、もう一度お試しください。
ko: cmux가 %@에 hooks 디렉터리를 만들지 못했습니다. 상위 디렉터리 권한을 확인한 후 다시 시도하세요.
nb: cmux kunne ikke opprette hookmappen på %@. Kontroller tillatelsene for den overordnede mappen og prøv på nytt.
pl: cmux nie mógł utworzyć katalogu hooków w %@. Sprawdź uprawnienia katalogu nadrzędnego i spróbuj ponownie.
pt_br: O cmux não conseguiu criar o diretório de hooks em %@. Verifique as permissões do diretório pai e tente novamente.
ru: cmux не удалось создать каталог хуков по пути %@. Проверьте разрешения родительского каталога и повторите попытку.
th: cmux ไม่สามารถสร้างไดเรกทอรี hooks ที่ %@ ได้ โปรดตรวจสอบสิทธิ์ของไดเรกทอรีหลักแล้วลองอีกครั้ง
tr: cmux %@ konumunda hooks dizinini oluşturamadı. Üst dizinin izinlerini kontrol edip yeniden deneyin.
uk: cmux не вдалося створити каталог хуків за шляхом %@. Перевірте дозволи батьківського каталогу та повторіть спробу.
zh_hans: cmux 无法在 %@ 创建 hooks 目录。请检查父目录权限，然后重试。
zh_hant: cmux 無法在 %@ 建立 hooks 目錄。請檢查上層目錄權限，然後再試一次。

# cli.hooks.error.configDirectoryIsFile
source: cmux could not create the hooks directory: a file exists at %@. Remove or rename the conflicting file, then run `cmux hooks setup` again.
ar: تعذّر على cmux إنشاء دليل hooks: يوجد ملف في %@. أزل الملف المتعارض أو أعد تسميته، ثم شغّل `cmux hooks setup` مرة أخرى.
bs: cmux nije mogao kreirati direktorij hookova: datoteka postoji na %@. Uklonite ili preimenujte konfliktnu datoteku, a zatim ponovo pokrenite `cmux hooks setup`.
da: cmux kunne ikke oprette hookmappen: der findes en fil på %@. Fjern eller omdøb filen, og kør derefter `cmux hooks setup` igen.
de: cmux konnte das Hook-Verzeichnis nicht erstellen: Unter %@ ist bereits eine Datei vorhanden. Entferne die Datei oder benenne sie um und führe dann `cmux hooks setup` erneut aus.
es: cmux no pudo crear el directorio de hooks: ya existe un archivo en %@. Elimina o cambia el nombre del archivo en conflicto y vuelve a ejecutar `cmux hooks setup`.
fr: cmux n’a pas pu créer le dossier des hooks : un fichier existe à l’emplacement %@. Supprimez ou renommez ce fichier, puis relancez `cmux hooks setup`.
it: cmux non è riuscito a creare la directory degli hook: esiste già un file in %@. Rimuovi o rinomina il file in conflitto, quindi esegui di nuovo `cmux hooks setup`.
ja: cmux は hooks ディレクトリを作成できませんでした。%@ にファイルがあります。競合するファイルを削除または名前変更してから `cmux hooks setup` を再実行してください。
ko: cmux가 hooks 디렉터리를 만들지 못했습니다. %@에 파일이 있습니다. 충돌하는 파일을 제거하거나 이름을 바꾼 다음 `cmux hooks setup`을 다시 실행하세요.
nb: cmux kunne ikke opprette hookmappen: det finnes en fil på %@. Fjern eller gi nytt navn til filen, og kjør deretter `cmux hooks setup` på nytt.
pl: cmux nie mógł utworzyć katalogu hooków: w %@ istnieje plik. Usuń plik powodujący konflikt lub zmień jego nazwę, a następnie ponownie uruchom `cmux hooks setup`.
pt_br: O cmux não conseguiu criar o diretório de hooks: existe um arquivo em %@. Remova ou renomeie o arquivo conflitante e execute `cmux hooks setup` novamente.
ru: cmux не удалось создать каталог хуков: по пути %@ уже существует файл. Удалите или переименуйте этот файл, затем снова выполните `cmux hooks setup`.
th: cmux ไม่สามารถสร้างไดเรกทอรี hooks ได้ เนื่องจากมีไฟล์อยู่ที่ %@ โปรดลบหรือเปลี่ยนชื่อไฟล์ที่ขัดแย้ง แล้วเรียกใช้ `cmux hooks setup` อีกครั้ง
tr: cmux hooks dizinini oluşturamadı: %@ konumunda bir dosya var. Çakışan dosyayı kaldırın veya yeniden adlandırın, ardından `cmux hooks setup` komutunu tekrar çalıştırın.
uk: cmux не вдалося створити каталог хуків: за шляхом %@ вже існує файл. Видаліть або перейменуйте цей файл, а потім знову виконайте `cmux hooks setup`.
zh_hans: cmux 无法创建 hooks 目录：%@ 处已有文件。请移除或重命名冲突文件，然后再次运行 `cmux hooks setup`。
zh_hant: cmux 無法建立 hooks 目錄：%@ 已有檔案。請移除或重新命名衝突的檔案，然後再次執行 `cmux hooks setup`。

# cli.hooks.error.pinnedTargetMissing
source: cmux could not connect this hook installation to a running app. Open a cmux workspace and run this command again.
ar: تعذّر على cmux ربط تثبيت الـ hooks هذا بتطبيق قيد التشغيل. افتح مساحة عمل في cmux وشغّل هذا الأمر مرة أخرى.
bs: cmux nije mogao povezati ovu instalaciju hookova s pokrenutom aplikacijom. Otvorite cmux radni prostor i ponovo pokrenite ovu naredbu.
da: cmux kunne ikke forbinde denne hookinstallation med en kørende app. Åbn et cmux-arbejdsområde, og kør kommandoen igen.
de: cmux konnte diese Hook-Installation nicht mit einer laufenden App verbinden. Öffne einen cmux-Arbeitsbereich und führe diesen Befehl erneut aus.
es: cmux no pudo conectar esta instalación de hooks con una aplicación en ejecución. Abre un espacio de trabajo de cmux y vuelve a ejecutar este comando.
fr: cmux n’a pas pu relier cette installation de hooks à une application en cours d’exécution. Ouvrez un espace de travail cmux et relancez cette commande.
it: cmux non è riuscito a collegare questa installazione di hook a un’app in esecuzione. Apri uno spazio di lavoro cmux ed esegui di nuovo questo comando.
ja: cmux はこの hook のインストールを実行中のアプリに接続できませんでした。cmux ワークスペースを開き、このコマンドをもう一度実行してください。
ko: cmux가 이 훅 설치를 실행 중인 앱에 연결하지 못했습니다. cmux 작업 공간을 열고 이 명령을 다시 실행하세요.
nb: cmux kunne ikke koble denne hookinstallasjonen til en app som kjører. Åpne et cmux-arbeidsområde og kjør kommandoen på nytt.
pl: cmux nie mógł połączyć tej instalacji hooków z uruchomioną aplikacją. Otwórz obszar roboczy cmux i uruchom to polecenie ponownie.
pt_br: O cmux não conseguiu conectar esta instalação de hooks a um aplicativo em execução. Abra um espaço de trabalho do cmux e execute este comando novamente.
ru: cmux не удалось связать эту установку хуков с запущенным приложением. Откройте рабочее пространство cmux и выполните эту команду снова.
th: cmux ไม่สามารถเชื่อมต่อการติดตั้ง hooks นี้กับแอปที่กำลังทำงานอยู่ได้ เปิดพื้นที่ทำงาน cmux แล้วเรียกใช้คำสั่งนี้อีกครั้ง
tr: cmux bu hook kurulumunu çalışan bir uygulamaya bağlayamadı. Bir cmux çalışma alanı açın ve bu komutu yeniden çalıştırın.
uk: cmux не вдалося пов’язати це встановлення хуків із запущеною програмою. Відкрийте робочий простір cmux і виконайте цю команду ще раз.
zh_hans: cmux 无法将此 hooks 安装连接到正在运行的应用。请打开一个 cmux 工作区，然后再次运行此命令。
zh_hant: cmux 無法將此 hooks 安裝連接到執行中的應用程式。請開啟 cmux 工作區，然後再次執行此命令。

# cli.hooks.kimi.aborted
source: Aborted.
ar: تم الإلغاء.
de: Abgebrochen.
es: Abortado.
fr: Annulé.
ja: 中止しました。
ko: 중단되었습니다.
zh_hans: 已中止。
zh_hant: 已中止。

# cli.hooks.kimi.alreadyUpToDate
source: %@ hooks already up to date at %@
ar: خطافات %@ محدثة بالفعل في %@
de: %@-Hooks unter %@ bereits auf dem neuesten Stand
es: Los hooks de %@ ya están actualizados en %@
fr: hooks de %@ déjà à jour dans %@
ja: %@ hooks はすでに %@ で最新です
ko: %@ 훅이 이미 %@에서 최신 상태입니다.
zh_hans: %@ hooks 已是最新，位置：%@
zh_hant: %@ 勾點在 %@ 已是最新狀態

# cli.hooks.kimi.confirmProceed
source: Proceed? [y/N]
ar: هل ترغب في المتابعة؟ [y/N]
de: Fortfahren? [j/N]
es: ¿Proceder? [s/N]
fr: Continuer ? [o/N]
ja: 続行しますか? [y/N]
ko: 계속하시겠습니까? [y/N]
zh_hans: 是否继续？ [y/N]
zh_hant: 是否繼續？ [y/N]

# cli.hooks.kimi.installed
source: %@ hooks installed at %@
ar: تم تثبيت خطافات %@ في %@
de: %@-Hooks wurden unter %@ installiert
es: Hooks de %@ instalados en %@
fr: Hooks %@ installés à l'emplacement %@
ja: %@ hooks を %@ にインストールしました
ko: %@ 훅이 %@에 설치되었습니다.
zh_hans: 已安装 %@ hooks，位置：%@
zh_hant: %@ 勾點已安裝於 %@

# cli.hooks.kimi.noneFound
source: No %@ found at %@
ar: لم يتم العثور على أي %@ في %@
de: Kein %@ unter %@ gefunden
es: No se encontró ningún %@ en %@
fr: Aucun %@ trouvé à l'emplacement %@
ja: %@ は %@ に見つかりませんでした
ko: %@(이)가 %@에서 발견되지 않았습니다
zh_hans: 未找到 %@，位置：%@
zh_hant: %@ 未於 %@ 尋獲

# cli.hooks.kimi.removed
source: Removed Kimi Code cmux hooks from %@
ar: تمت إزالة خطافات Kimi Code cmux من %@
de: Kimi Code-cmux-Hooks aus %@ entfernt
es: Se eliminaron los hooks de cmux de Kimi Code de %@
fr: Hooks cmux de Kimi Code supprimés de %@
ja: %@ から Kimi Code cmux hooks を削除しました
ko: %@에서 Kimi Code cmux 훅을 제거했습니다.
zh_hans: 已从 %@ 移除 Kimi Code cmux hooks
zh_hant: 已從 %@ 移除 Kimi Code cmux 勾點

# cli.hooks.kimi.removedZero
source: Removed 0 cmux hook(s) from %@
ar: تمت إزالة 0 من خطافات cmux من %@
de: 0 cmux-Hook(s) aus %@ entfernt
es: Se eliminaron 0 hooks de cmux de %@
fr: 0 hook(s) cmux supprimé(s) de %@
ja: %@ から 0 個の cmux hook を削除しました
ko: %@에서 0개의 cmux 훅을 제거했습니다.
zh_hans: 已从 %@ 移除 0 个 cmux hook
zh_hant: 已從 %@ 移除 0 個 cmux 勾點

# cli.hooks.kimi.secondaryRefreshWarning
source: Warning: cmux hooks are installed at %@, but cmux could not refresh its existing hook block in %@. Check that path and re-run `cmux hooks setup kimi` to finish the update.
ar: تحذير: تم تثبيت خطافات cmux في %@، لكن تعذّر على cmux تحديث كتلة الخطافات الموجودة في %@. تحقّق من هذا المسار وأعد تشغيل `cmux hooks setup kimi` لإكمال التحديث.
bs: Upozorenje: cmux hookovi su instalirani u %@, ali cmux nije mogao osvježiti postojeći blok hookova u %@. Provjerite tu putanju i ponovo pokrenite `cmux hooks setup kimi` da dovršite ažuriranje.
da: Advarsel: cmux-hooks er installeret i %@, men cmux kunne ikke opdatere sin eksisterende hook-blok i %@. Tjek den sti, og kør `cmux hooks setup kimi` igen for at fuldføre opdateringen.
de: Warnung: cmux-Hooks sind in %@ installiert, aber cmux konnte den vorhandenen Hook-Block in %@ nicht aktualisieren. Prüfe diesen Pfad und führe `cmux hooks setup kimi` erneut aus, um die Aktualisierung abzuschließen.
es: Advertencia: los hooks de cmux están instalados en %@, pero cmux no pudo actualizar su bloque de hooks existente en %@. Revisa esa ruta y vuelve a ejecutar `cmux hooks setup kimi` para completar la actualización.
fr: Avertissement : les hooks cmux sont installés dans %@, mais cmux n'a pas pu actualiser son bloc de hooks existant dans %@. Vérifiez ce chemin et relancez `cmux hooks setup kimi` pour terminer la mise à jour.
it: Avviso: gli hook di cmux sono installati in %@, ma cmux non è riuscito ad aggiornare il blocco di hook esistente in %@. Controlla quel percorso ed esegui di nuovo `cmux hooks setup kimi` per completare l'aggiornamento.
ja: 警告: cmux hooks は %@ にインストールされましたが、%@ にある既存の hook ブロックを更新できませんでした。そのパスを確認し、`cmux hooks setup kimi` を再実行して更新を完了してください。
ko: 경고: cmux hooks가 %@에 설치되었지만 %@에 있는 기존 hook 블록을 갱신하지 못했습니다. 해당 경로를 확인한 뒤 `cmux hooks setup kimi`를 다시 실행해 업데이트를 완료하세요.
nb: Advarsel: cmux-hooks er installert i %@, men cmux kunne ikke oppdatere den eksisterende hook-blokken i %@. Sjekk den banen og kjør `cmux hooks setup kimi` på nytt for å fullføre oppdateringen.
pl: Ostrzeżenie: hooki cmux są zainstalowane w %@, ale cmux nie mógł odświeżyć istniejącego bloku hooków w %@. Sprawdź tę ścieżkę i uruchom ponownie `cmux hooks setup kimi`, aby dokończyć aktualizację.
pt_br: Aviso: os hooks do cmux estão instalados em %@, mas o cmux não conseguiu atualizar o bloco de hooks existente em %@. Verifique esse caminho e execute `cmux hooks setup kimi` novamente para concluir a atualização.
ru: Предупреждение: хуки cmux установлены в %@, но cmux не смог обновить существующий блок хуков в %@. Проверьте этот путь и запустите `cmux hooks setup kimi` ещё раз, чтобы завершить обновление.
th: คำเตือน: ติดตั้ง cmux hooks ไว้ที่ %@ แล้ว แต่ cmux ไม่สามารถอัปเดตบล็อก hook ที่มีอยู่ใน %@ ได้ ตรวจสอบพาธนั้นแล้วรัน `cmux hooks setup kimi` อีกครั้งเพื่อทำการอัปเดตให้เสร็จสมบูรณ์
tr: Uyarı: cmux hook'ları %@ konumuna kuruldu ancak cmux, %@ içindeki mevcut hook bloğunu güncelleyemedi. Bu yolu kontrol edin ve güncellemeyi tamamlamak için `cmux hooks setup kimi` komutunu yeniden çalıştırın.
uk: Попередження: хуки cmux встановлено в %@, але cmux не зміг оновити наявний блок хуків у %@. Перевірте цей шлях і запустіть `cmux hooks setup kimi` ще раз, щоб завершити оновлення.
zh_hans: 警告：cmux hooks 已安装到 %@，但 cmux 无法刷新 %@ 中已有的 hook 块。请检查该路径，然后重新运行 `cmux hooks setup kimi` 以完成更新。
zh_hant: 警告：cmux hooks 已安裝到 %@，但 cmux 無法更新 %@ 中既有的 hook 區塊。請檢查該路徑，然後重新執行 `cmux hooks setup kimi` 以完成更新。
